hierarchical_relationship = {
    "任务意图理解": {
        "在干扰下完成指令": {}
    },
    "单元细节合规": {
        "主题约束": {},
        "文体约束": {
            "生成特定文案": {},
            "生成名字/标题": {}
        },
        "语言约束": {
            "中英文混杂": {},
            "繁体约束": {},
            "大小写": {}
        },
        "格式约束": {
            "特定格式": {},
            "日期格式": {}
        },
        "字数约束": {
            "精确": {},
            "范围": {},
            "倍数": {},
            "多对象": {},
            "0~10字": {},
            "10~50字": {},
            "50~200字": {},
            "200字以上": {}
        },
        "其他特殊规则": {
            "押韵": {},
            "关键词": {},
            "重复": {},
            "平仄": {},
            "接龙": {},
            "emoji": {},
            "符号": {},
            "写作手法": {},
            "词频": {}
        }
    },
    "整体结构合规": {
        "模版合规": {
            "LaTeX": {},
            "JSON": {},
            "Markdown": {}
        },
        "单元数量合规": {},
        "答题逻辑合规": {
            "答题结构合规": {},
            "全面考虑": {}
        }
    }
}
